** Subject Parameters Affect Stride Characteristics
The stride parameter model quantifies how stride (or gait) characteristics in bipedal baboon walking are affected by subject parameters (Tab. \ref{tab:strideresults}).

Clearance is highest in adult males of low bodymass.
Females and subadults lift their feet less during the swing, as do animals of comparatively higher bodymass.
Dutyfactor is higher in infants: they are in ground contact for a longer portion of the stride.
All of the three speed-related parameters (i.e. distance, frequency, speed; all dimensionless) are affected by bodymass, though the effect is only "significant" for frequency.
Animals of higher bodymass tend to take shorter steps of higher frequency, which seems to overcompensate in terms of speed.
Infants cover lower relative distance at lower frequency, which adds up in terms of relative speed.
The results on trunk angle show that males hold their upper body less upright than females (i.e. at a higher trunk angle; though as with any sex effect this might be due to few, influential observations).
Although this inference can only stem from the subadult classes, it is separate from (and in opposing direction of) an age effect: adults seem to walk more crouched than infants (i.e. infants walk with a lower trunk angle, more upright).

#+BEGIN_SRC emacs-lisp :exports none :results silent
  (setq org-babel-inline-result-wrap "\\(%s\\)")
#+END_SRC


#+BEGIN_SRC python :results output :exports none :session strideresults :tangle yes
import os as OS
OS.chdir(OS.read(OS.open('homedir.txt', OS.O_RDONLY), 1000).strip())

import numpy as NP
import pandas as PD

n_iterations = 16384 # 32768

results = PD.read_csv(f'models/stride/reference_{n_iterations}.csv', sep = ';') \
            .set_index('effect', inplace = False) # ['observable', 'effect', 'predictor']
# print (results)
print (results.loc['dof', 'mean'])
#+END_SRC

#+RESULTS:
: 54.157

A value which is sampled, but not shown, is the \(\nu\) parameter (or degrees of freedom, see ch. \ref{bodymass:results}) of the Student's T posterior.
It is high (src_python[:session strideresults]{f"\\nu = {results.loc['dof', 'mean']:.1f}"} {{{results(\(\nu = 54.2\))}}}), indicating that the posterior distribution has little more "weight in the tails" than a Normal distribution would.


#+CAPTION: *Effects of Subject Characteristics on Stride Cycle Parameters.* Significant values (i.e. values with zero not in HDI) are indicated by an asterisk.
#+LABEL: tab:strideresults
#+INCLUDE: "../results/stride_predictors.org"


